app/views/static_pages/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
              <div class="item-info-left">
                <span class> <%= User.find(each_artical.user).name  %></span>