app/views/articals/_form.html.erb

SELECT DISTINCT category FROM "articals"
---
                <div class="form-group">
                  <% @all_artical=Artical.select("category").distinct%>