app/views/articals/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
    <div class="item-info-left">
      <span class> <%= User.find(@artical.user).name  %></span>