app/controllers/articals_controller.rb

  def index
    @articals = Artical.all
---
SELECT "articals".* FROM "articals"

  def create
    @artical = Artical.new(artical_params)

    respond_to do |format|
      if @artical.save
---
INSERT INTO "articals" ("category", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["category", "选择分类"], ["content", "22"], ["created_at", Mon, 07 Jan 2019 10:21:57 UTC +00:00], ["title", "2"], ["updated_at", Mon, 07 Jan 2019 10:21:57 UTC +00:00]]

    def set_artical
      @artical = Artical.find(params[:id])
---
SELECT "articals".* FROM "articals" WHERE "articals"."id" = ? LIMIT 1  [["id", "1"]]