app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.passages.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "zzz"], ["created_at", Tue, 04 Dec 2018 14:24:07 UTC +00:00], ["updated_at", Tue, 04 Dec 2018 14:24:07 UTC +00:00], ["user_id", 1]]