app/controllers/passages_controller.rb

SELECT "passages".* FROM "passages"
---
  def index
    @passages = Passage.all

INSERT INTO "passages" ("catagory", "content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["catagory", "1"], ["content", "请吃饭"], ["created_at", Sun, 06 Jan 2019 09:45:29 UTC +00:00], ["title", "我要吃饭"], ["updated_at", Sun, 06 Jan 2019 09:45:29 UTC +00:00]]
---
  def create
    @passage = Passage.new(passage_params)
    if @passage.save

SELECT "passages".* FROM "passages" WHERE "passages"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_passage
      @passage = Passage.find(params[:id])