app/controllers/static_pages_controller.rb

SELECT "articals".* FROM "articals"
---
  def home
    if signed_in?
      @articals = Artical.all