app/controllers/static_pages_controller.rb

  def home
    if signed_in?
      @passages = Passage.all
---
SELECT "passages".* FROM "passages"