app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @passages = @user.passages.paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "passages".* FROM "passages" WHERE "passages"."user_id" = ? LIMIT 30 OFFSET 0  [["user_id", 2]]
SELECT COUNT(*) FROM "passages" WHERE "passages"."user_id" = ?  [["user_id", 1]]