app/views/passages/new.html.erb

SELECT DISTINCT catagory FROM "passages"
---

            <% @all_passage=Passage.select("catagory").distinct%>